bzt/koa.yml
execution:
  - concurrency: 1667
    hold-for: 5m
    ramp-up: 3m
    scenario: main
settings:
  artifacts-dir: ./taurus/%Y-%m-%d_%H-%M-%S.%f
  check-interval: 5s
scenarios:
  main:
    requests:
      - url: http://localhost:3002/register
        method: POST  
        headers:
          Content-Type: application/json
        body: 
          name: test
          email: test@test.com
          password: password
reporting:
  - module: blazemeter
modules:
  blazemeter:
    token: a7b9ecf472c535c1937aa418:a0d4c325ddbf34cec054f1971f4caefbdab0ac06335501fa6f1bdde6d03da494c18ca584
    address: https://a.blazemeter.com # reporting service address
    data-address: https://data.blazemeter.com # data service address
    browser-open: start # auto-open the report in browser,
    # can be "start", "end", "both", "none"
    send-interval: 30s # send data each n-th second
    report-times-multiplier: 1000 # multiplying factor for response times, advanced option
    timeout: 5s # connect and request timeout for BlazeMeter API
    artifact-upload-size-limit: 5 # limit max size of file (in megabytes)
    # that goes into zip for artifact upload, 10 by default
    public-report: false # set to true to create a public link to the report
    request-logging-limit: 10240 # use this to dump more of request/response data into logs, for debugging
    # following instructions will have effect when no per-reporter settings
    report-name: Test koa 500k concurrency in 5 min on localhost and mongo in memory # if you will use value 'ask', it will ask it from command line
    test: Test koa 500k concurrency in 5 min on localhost and mongo in memory
    # test: Test get user
    project: OKRs
    upload-artifacts: true